# models.card
# -*- coding: UTF-8 -*-

ADMINS = [
    "1000001", #ahbei
    "1645921", #bear
    "1440291", #whshang
    "49507619", #jiaojiao
]

EDITORS = [
    "29126196", #zhangnan
    "2527632", #CMGS
]

PROVINCE = [
"",
"上海",
"北京",
"天津",
"重庆",
"河北",
"山东",
"辽宁",
"黑龙江",
"吉林",
"甘肃",
"青海",
"河南",
"江苏",
"湖北",
"湖南",
"江西",
"浙江",
"广东",
"云南",
"福建",
"海南",
"山西",
"四川",
"陕西",
"贵州",
"安徽",
"广西",
"内蒙古",
"西藏",
"新疆",
"宁夏",
"香港",
"澳门",
"台湾",
]

ZODIACS = [
    (0, '未知'),
    (1, '鼠'),
    (2, '牛'),
    (3, '虎'),
    (4, '兔'),
    (5, '龙'),
    (6, '蛇'),
    (7, '马'),
    (8, '羊'),
    (9, '猴'),
    (10, '鸡'),
    (11, '狗'),
    (12, '猪'),
]

ASTROS = [
    (0, '未知'),
    (1, '白羊座'),
    (2, '金牛座'),
    (3, '双子座'),
    (4, '巨蟹座'),
    (5, '狮子座'),
    (6, '处女座'),
    (7, '天秤座'),
    (8, '天蝎座'),
    (9, '射手座'),
    (10, '摩羯座'),
    (11, '水瓶座'),
    (12, '双鱼座')
]

SEXS = [
    (0, '保密'),
    (1, '男'),
    (2, '女'),
    ]

LOVES = [
    (0, '保密'),
    (1, '男'),
    (2, '女'),
    (3, '均可'),
    (4, '无（那尼？）'),
    ]

MARRIAGES = [
    (0, '保密'),
    (1, '单身'),
    (2, '求交往'),
    (3, '暗恋中'),
    (4, '暧昧中'),
    (5, '恋爱中'),
    (6, '同居中'),
    (7, '订婚'),
    (8, '已婚'),
    (9, '分居（嗯...）'),
    (10, '离异（啊！）'),
    (11, '丧偶（哦...）'),
    (12, '男女老少通杀(禽兽？)'),
    (13, '难以言明'),
    ]

TAGS = [
    '80s', '70s', '90s', '00s', '单身','已婚','有主',
    '汉子','妹子','少年','萝莉','老人','熊','萌',
    '小孩党','车党','葛洲坝党','德味党',
    'BD', 'PR', 'Coder', 'PM', 'HR', 'SA', 'QA', 'DBA', 'Boss', 'Intern', 'Scientist',
    '书','影','音','社区','同城','电台','阅读','小组', '移动', '数据', '平台',
    '设计师', '后端', '前端', '算法', '广告', '行政', 'IT',
    'A区', '阳光普照B区', 'C区'
    ]

MAX_SIZE = 10*1024*1024 #5M

CITYS = [ "上海", "东莞", "佛山", "北京", "南京", "南通", "哈尔滨", "唐山", "大庆", "大连", "天津", "宁波", "常州", "广州", "成都", "无锡", "杭州", "杭州　", "武汉", "沈阳", "泉州", "济南", "淄博", "深圳", "温州", "潍坊", "烟台", "石家庄", "福州", "绍兴", "苏州", "西安", "郑州", "重庆", "长春", "长沙", "青岛" ]

class Cate(object):
    ICON = "i"
    SMALL = "s"
    LARGE = "l"
    ORIGIN = "o"
    RESIZE = "r"

CATES = [Cate.ICON, Cate.SMALL, Cate.LARGE]
CATE_NAMES = ['icon', 'small', 'large']
CATES_ALL = [Cate.ICON, Cate.SMALL, Cate.LARGE, Cate.ORIGIN]
DEFAULT_CONFIG = {
    Cate.ICON  : {
        'width': 96,
        'height': 96,
        'scale': 'center-crop',
        'gif_scale': 'fill-start',
        },
    Cate.SMALL : {
        'width': 256,
        'height': 256,
        'scale': 'center-crop',
        'gif_scale': 'fill-start',
        },
    Cate.LARGE :{
        'width': 960,
        'height': 960,
        'scale': 'fill-start',
        'gif_scale': 'fill-start',
        },
    }

CONTENT_TYPE_DICT = {
    'image/jpeg': 'jpg',
    'image/png' : 'png',
    'image/gif' : 'gif',
    'audio/mp3' : 'mp3',
    'audio/amr' : 'amr',
}

EMOTICONS = [
"ಠωಠ",
"Ծ‸Ծ",
">ω<",
"≖‿≖✧",
"〒▽〒",
"╭(╯^╰)╮",
"╮(╯▽╰)╭",
"(￣Ծ￣)",
"（︶^︶）",
"（#￣▽￣#）",
"(￣﹏￣)",
"<(￣︶￣)>",
"o(￣ヘ￣o* )",
"Σ( ° △ °|||)︴",
"ㄟ(▔皿▔ㄟ)",
"(づ￣ 3￣)づ",
"m(_ _)m",
"_(:з」∠)_",
"(｡◕ˇ_ˇ◕｡)",
"（◕㉨◕）",
"(=￣ω￣=)",
]
